Revit 2026 API

# AdvancedWoodWoodUseGrooveRoughness Property

---

The property labeled "Use additional groove roughness" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodUseGrooveRoughness { get; }
```
```vb
Public Shared ReadOnly Property WoodUseGrooveRoughness As String
	Get
```
```cpp
public:
static property String^ WoodUseGrooveRoughness {
	String^ get ();
}
```
```fsharp
static member WoodUseGrooveRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace